import numpy as np
from sigmoid import sigmoid

def computeCost(X, y, num_labels, Theta1, Theta2, lam):
    """
        Функция позволяет вычислить значение стоимостной функции, 
        используя матрицы Theta1 и Theta2 в качестве параметров 
        для нейронной сети, параметр регуляризации lam, матрицу 
        объекты-признаки X и вектор меток y
    """
    
    m = y.shape[0]
    J = 0

    # ====================== Ваш код здесь ======================
    # Инструкция: вычислить значение стоимостной функции для заданных 
    # Theta1, Theta2, lam, X и y. Присвоить полученный результат в J 
    # для стоимостной функции
    
    
    
    # ============================================================
    
    return J